'''
求解《百钱百鸡》问题
1只公鸡5元 1只母鸡3元 3只小鸡1元 用100元买100只鸡
问公鸡 母鸡 小鸡各有多少只
------
设公母小鸡各a,b,c只
则有：
5a + 3b + c/3 = 100
a + b + c = 100
得 => 4c/3-100 = a
所以要想求出两个方程三个解，只能根据两个方程来猜
'''
## 解法一：循环次数少：34
print('百钱百鸡有以下情况：')
for c in range(0,100,3):
	i += 1
	a = 4*c / 3 - 100
	b = 100 - a - c
	if a >= 0 and b >= 0:
		print('公鸡%d只，母鸡%d只，小鸡%d只' % (a,b,c))

## 解法二:循环了660次，但逻辑清晰，无需事先解方程组
'''
for x in range(0, 20):
	for y in range(0, 33):
		z = 100 - x - y
		if 5 * x + 3 * y + z / 3 == 100:
			print('公鸡: %d只, 母鸡: %d只, 小鸡: %d只' % (x, y, z))
'''